let memVan6 = ["시즈", "백파이프", "사가", "사일라흐", "플레임테일", "비질", "이네스", "뮤엘시스", "불피스폴리아"];
let memGuard6 = ["실버애쉬", "스카디", "첸", "헬라그", "블레이즈", "쏜즈", "수르트", "마운틴", "팔라스", "니어 더 래디언트 나이트", "아이린", "가비알 디 인빈서블", "무에나", "총웨", "치우바이", "이그제큐터 디 엑스 포에데레", "외드레르", "레싱", "비비아나", "데겐블레허", "좌락", "울피아누스", "페페", "비나 빅토리아", "엔텔레키아", "레이즈 더 썬더브링어", "토가와 사키코"];
let memDefend6 = ["호시구마", "사리아", "니엔", "유넥티스", "블레미샤인", "머드락", "혼", "페넌스", "제시카 더 리버레이티드", "슈", "위", "산크타 믹사파라토", "호시구마 더 브리처"];
let memSnipe6 = ["엑시아", "슈바르츠", "W", "로사", "로즈몬티스", "아르케토", "Ash", "첸 더 홀룽데이", "파투스", "피아메타", "파죰카", "티폰", "레이", "위셔델", "나란투야", "르무엔"];
let memCast6 = ["이프리트", "에이야퍄들라", "모스티마", "케오베", "시", "패신저", "카넬리안", "골든글로우", "에벤홀츠", "린", "오올헤약", "로고스", "님프", "마르실", "라플란드 더 데카덴차", "블레이즈 디 이그나이팅 스파크", "네크라스"];
let memMedic6 = ["샤이닝", "나이팅게일", "켈시", "루멘", "리드 더 플레임 섀도우", "에이야퍄들라 더 크비트 아스카", "Mon3tr"];
let memSupp6 = ["안젤리나", "마젤란", "스즈란", "스카디 더 커럽팅 하트", "노시스", "링", "스테인리스", "사일런스 더 패러디그매틱", "비르투오사", "시빌라이트 에테르나", "트라고디아", "라이디언", "하루카"];
let memSpecial6 = ["아", "팬텀", "위디", "글래디아", "미즈키", "리", "스펙터 디 언체인드", "도로시", "텍사스 디 오메르토사", "키린R 야토", "스와이어 디 엘리건트 위트", "Ela", "아스카론", "크라운슬레이어", "쏜즈 더 로드스타", "엑시아 더 뉴 커버넌트"];

let memVan5 = ["텍사스", "지마", "그라니", "리드", "엘리시움", "키아베", "와일드메인", "블랙나이트", "칸타빌레", "퍼즐", "폰사이러스", "완칭", "케스트럴", "팽 더 파이어 샤픈드", "미틈", "칠책", "서퍼", "마츠키리"];
let memGuard5 = ["프란카", "스펙터", "인드라", "라플란드", "새비지", "스와이어", "아스테시아", "플레임브링어", "브로카", "바이비크", "시데로카", "에이어스카르페", "플린트", "위슬래시", "Tachanka", "아카후유", "테킬라", "라 플루마", "하이모어", "다그다", "윈드차임스", "레우스S 느와르 코르네", "모건", "브라이오피타", "레토", "Fuze", "Doc", "오다", "라이오스", "그레이스베어러", "유텐지 냐무"];
let memDefend5 = ["니어", "리스캄", "벌컨", "크루아상", "바이슨", "훔", "아스베스토스", "Blitz", "헤비레인", "애쉬락", "오로라", "샬렘", "체르니", "파이어휘슬", "시멘트", "베이스라인", "언더플로우", "센시", "필라에"];
let memSnipe5 = ["메테오라이트", "블루포이즌", "파이어워치", "프로방스", "플래티넘", "이그제큐터", "그레이스롯", "세사", "안드레아나", "에이프릴", "아오스타", "토디폰스", "크루스 더 킨 글린트", "에라토", "그레이 더 라이트닝베어러", "루나컵", "지에윈", "멜라나이트", "인사이더", "콜드샷", "브리지드", "키치세이"];
let memCast5 = ["아미야", "나이트메어", "스카이파이어", "레이즈", "압생트", "레온하르트", "비즈왁스", "토미미", "민트", "아이리스", "라바 더 퍼거토리", "코로세럼", "쉐라", "락락", "아스트젠", "미니멀리스트", "카니팔라트", "아르모니", "산탈라", "델핀", "디아만테", "워미", "아로마", "테크노", "미스 크리스틴"];
let memMedic5 = ["프틸롭시스", "사일런스", "와파린", "실론", "브리즈", "폴리닉", "위스퍼레인", "투예", "멀베리", "허니베리", "히비스커스 더 퓨리파이어", "파프리카", "벤델라", "해럴드", "파피루스", "로즈솔트", "노웰", "녹무관"];
let memSupp5 = ["프라마닉스", "메이어", "소라", "이스티나", "글라우쿠스", "샤마르", "츠키노기", "씬", "나인컬러드 디어", "퀘르쿠스", "하이디", "윈드플릿", "프로바이조", "발라크빈", "그레인버즈", "루실라", "샌드레코너", "캐서린", "보빙", "싱주", "알라나", "미스미 우이카"]
let memSpecial5 = ["레드", "맨티코어", "클리프하트", "에프이터", "와이후", "스노우상트", "카프카", "로빈", "우요우", "Frost", "베나", "키라라", "인포서", "카제마루", "스푸리아", "아몬드", "Iana", "틴맨", "피구리노", "울페나이트", "티피", "와카바 무츠미", "야하타 우미리"];

let memVan4 = ["스캐빈저", "쿠리어", "비그나", "머틀", "빈스토크"]
let memGuard4 = ["도베르만", "에스텔", "비헌터", "무스", "프로스트리프", "마토이마루", "우타게", "컨빅션", "커터", "아렌", "재키", "나소흑", "쿼츠", "휴머스", "윈드스쿠트"];
let memDefend4 = ["쿠오라", "굼", "마터호른", "듀나", "버블", "루토나다"]
let memSnipe4 = ["메이", "메테오", "시라유키", "제시카", "버메일", "엠브리엘", "애시드드롭", "파인콘", "토터", "케이퍼"];
let memCast4 = ["헤이즈", "기타노", "그레이", "클릭", "인디고", "푸딩"]
let memMedic4 = ["미르", "가비알", "퍼퓨머", "수수로", "퓨어스트림", "체스트넛"];
let memSupp4 = ["딥컬러", "어스스피릿", "포덴코", "로베르타"];
let memSpecial4 = ["그라벨", "로프", "쇼", "에단", "제이", "버던트", "콘트레일"];

let memVan3 = ["팽", "바닐라", "플룸"]
let memGuard3 = ["멜란사", "미드나이트", "포푸카"]
let memDefend3 = ["비글", "카디건", "스팟"]
let memSnipe3 = ["크루스", "아드나키엘", "캐터펄트"]
let memCast3 = ["스튜어드", "라바"]
let memMedic3 = ["히비스커스", "안셀"]
let memSupp3 = ["오키드"]
let memSpecial3 = []

let memVan2 = ["야토"]
let memGuard2 = []
let memDefend2 = ["느와르 코르네"]
let memSnipe2 = ["레인저"]
let memCast2 = ["두린", "12F"]
let memMedic2 = []
let memSupp2 = []
let memSpecial2 = []

let memVan1 = ["Confess-47"]
let memGuard1 = ["Castle-3"]
let memDefend1 = ["Friston-3"]
let memSnipe1 = ["저스티스 나이트", "테라 대륙 조사단"];
let memCast1 = []
let memMedic1 = ["Lancet-2"]
let memSupp1 = ["U-Official", "PhonoR-0"];
let memSpecial1 = ["THRM-EX"]

let memList = 
    [
        [[memVan1, "vanguard"], [memGuard1, "guard"], [memDefend1, "defender"], [memSnipe1, "sniper"], [memCast1, "caster"], [memMedic1, "medic"], [memSupp1, "supporter"], [memSpecial1, "specialist"]],
        [[memVan2, "vanguard"], [memGuard2, "guard"], [memDefend2, "defender"], [memSnipe2, "sniper"], [memCast2, "caster"], [memMedic2, "medic"], [memSupp2, "supporter"], [memSpecial2, "specialist"]],
        [[memVan3, "vanguard"], [memGuard3, "guard"], [memDefend3, "defender"], [memSnipe3, "sniper"], [memCast3, "caster"], [memMedic3, "medic"], [memSupp3, "supporter"], [memSpecial3, "specialist"]],
        [[memVan4, "vanguard"], [memGuard4, "guard"], [memDefend4, "defender"], [memSnipe4, "sniper"], [memCast4, "caster"], [memMedic4, "medic"], [memSupp4, "supporter"], [memSpecial4, "specialist"]],
        [[memVan5, "vanguard"], [memGuard5, "guard"], [memDefend5, "defender"], [memSnipe5, "sniper"], [memCast5, "caster"], [memMedic5, "medic"], [memSupp5, "supporter"], [memSpecial5, "specialist"]],
        [[memVan6, "vanguard"], [memGuard6, "guard"], [memDefend6, "defender"], [memSnipe6, "sniper"], [memCast6, "caster"], [memMedic6, "medic"], [memSupp6, "supporter"], [memSpecial6, "specialist"]]
    ]

//=================================================